Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.GetTypeIds
Returns ids of the types with duplicate names.
Since:
2014

Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.Document
The document that contains the types with duplicate names.
Since:
2014

Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs
A structure that provides information about an attempt to copy types with names that already exist in the destination document.
Since:
2014